// Данные расписания
const scheduleData = {
    'Пн': [
        { time: '10:00-11:20', type: 'Пр.', subject: 'Английский язык', teacher: 'Иванова А.А.', room: '1-05 (1-корпус, ауд.105)' },
        { time: '11:30-12:50', type: 'Лк.', subject: 'Программирование-робототехника', teacher: 'Петров Б.Б.', room: '2-10 (2-корпус, ауд.210)' },
        { time: '13:00-14:20', type: 'Лб.', subject: 'Физика', teacher: 'Камилов.Ш.С.', room: '3-01 (3-корпус, ауд.312)' },
        { time: '15:20-16:20', type: 'Лк.', subject: 'Информатика 2', teacher: 'Kурсанов.С.С.', room: '3-01 (3-корпус, ауд.312)' }
    ],
    'Вт': [
        { time: '10:00-11:20', type: 'Пр.', subject: 'Физика', teacher: 'Сидоров С.С.', room: '3-01 (3-корпус, ауд.301)' },
        { time: '13:00-14:20', type: 'Лк.', subject: 'Физика', teacher: 'K.С.С.', room: '3-01 (3-корпус, ауд.312)' },
        { time: '15:20-16:20', type: 'Лб.', subject: 'Математика 2', teacher: 'Жанаров.С.Э.', room: '3-01 (3-корпус, ауд.312)' }
    ],
    'Ср': [
        { time: '10:00-11:20', type: 'Лк.', subject: 'Математика 2', teacher: 'Дурмонбаева З.А.', room: '1-16 (2-корпус, ауд.2/307)' },
        { time: '15:00-16:20', type: 'Пр.', subject: 'Инженерная-графика', teacher: 'Кузнецов Д.Д.', room: '1-12 (1-корпус, ауд.112)' }
    ],
    'Чт': [
        { time: '10:00-11:20', type: 'Пр.', subject: 'Математика 2', teacher: 'Дурмонбаева З.А.', room: '1-16 (2-корпус, ауд.2/307)' },
        { time: '11:30-12:50', type: 'Пр.', subject: 'История Кыргызстана', teacher: 'Куттубекова В.М.', room: '1-16 (2-корпус, ауд.2/327)' },
        { time: '13:00-14:20', type: 'Пр.', subject: 'Физическая культура и спорт 2', teacher: 'Каюмов Т.А.', room: '1-16 (2-корпус, ауд.Стадион)' },
        { time: '15:00-16:20', empty: true },
        { time: '16:30-17:50', empty: true },
        { time: '18:00-19:20', empty: true },
        { time: '19:30-20:50', type: 'Лек.', subject: 'Математика', teacher: 'Доп. занятие', room: 'Оффлайн/Ауд. уточняется', highlight: true },
        { time: '21:00-22:00', empty: true }
    ],
    'Пт': [
        { time: '08:30-09:50', type: 'Лк.', subject: 'Кыргызский-язык', teacher: 'Нуржанова К.К.', room: '2-05 (2-корпус, ауд.205)' },
        { time: '11:30-12:50', type: 'Пр.', subject: 'История Кыргызстана', teacher: 'Куттубекова В.М.', room: '1-16 (2-корпус, ауд.2/327)' },
        { time: '13:00-14:20', type: 'Пр.', subject: 'Физическая культура и спорт 2', teacher: 'Каюмов Т.А.', room: '1-16 (2-корпус, ауд.Стадион)' },
    ],
    'Сб': [
        { time: '13:00-14:20', type: 'Лк.', subject: 'Физика', teacher: 'K.С.С.', room: '1-124 (1-корпус, ауд.124)' }
    ]
};
